[Killed] ConditionalExpression
src/operacoes.js:13:7
 }
 function potencia(base, expoente) { return Math.pow(base, expoente); }
 function raizQuadrada(n) {
-  if (n <= 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
+  if (false) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
   return Math.sqrt(n);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 6.1 deve lançar erro para raiz quadrada de zero e negativo
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Não é possível calcular a raiz quadrada de um número negativo."

Received function did not throw
