[Killed] BlockStatement
src/operacoes.js:12:26
   return a / b;
 }
 function potencia(base, expoente) { return Math.pow(base, expoente); }
-function raizQuadrada(n) {
-  if (n <= 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
-  return Math.sqrt(n);
-}
+function raizQuadrada(n) {}
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 6. deve calcular a raiz quadrada de um quadrado perfeito
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:13:7
 }
 function potencia(base, expoente) { return Math.pow(base, expoente); }
 function raizQuadrada(n) {
-  if (n <= 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
+  if (true) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
   return Math.sqrt(n);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 6. deve calcular a raiz quadrada de um quadrado perfeito
statusReason: Error: Não é possível calcular a raiz quadrada de um número negativo.

[Killed] EqualityOperator
src/operacoes.js:13:7
 }
 function potencia(base, expoente) { return Math.pow(base, expoente); }
 function raizQuadrada(n) {
-  if (n <= 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
+  if (n > 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
   return Math.sqrt(n);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 6. deve calcular a raiz quadrada de um quadrado perfeito
statusReason: Error: Não é possível calcular a raiz quadrada de um número negativo.

[Killed] EqualityOperator
src/operacoes.js:18:7
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
+  if (n >= 0) throw new Error('Fatorial não é definido para números negativos.');
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: Fatorial não é definido para números negativos.

[Killed] ConditionalExpression
src/operacoes.js:34:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui valor máximo.');
+  if (true) throw new Error('Array vazio не possui valor máximo.');
   return Math.max(...numeros);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: Array vazio не possui valor máximo.

[Killed] ConditionalExpression
src/operacoes.js:38:7
   return Math.max(...numeros);
 }
 function minimoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
+  if (true) throw new Error('Array vazio не possui valor mínimo.');
   return Math.min(...numeros);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: Array vazio не possui valor mínimo.

[Killed] BlockStatement
src/operacoes.js:44:21
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
 function isPar(n) { return n % 2 === 0; }
-function isImpar(n) { return n % 2 !== 0; }
+function isImpar(n) {}
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 16. deve retornar true para um número ímpar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:88:7
   return numeros.reduce((acc, val) => acc * val, 1);
 }
 function clamp(valor, min, max) {
-  if (valor < min) return min;
+  if (valor >= min) return min;
   if (valor > max) return max;
   return valor;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
src/operacoes.js:89:7
 }
 function clamp(valor, min, max) {
   if (valor < min) return min;
-  if (valor > max) return max;
+  if (valor <= max) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] ConditionalExpression
src/operacoes.js:92:51
   if (valor > max) return max;
   return valor;
 }
-function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
+function isDivisivel(dividendo, divisor) { return false; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 37. deve verificar se um número é divisível por outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/operacoes.js:93:50
   return valor;
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
-function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
+function celsiusParaFahrenheit(celsius) { return celsius * 9 / 5 - 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
 function inverso(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 38. deve converter Celsius para Fahrenheit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 32
Received: -32

[Killed] BlockStatement
src/operacoes.js:94:44
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
-function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
+function fahrenheitParaCelsius(fahrenheit) {}
 function inverso(n) {
   if (n === 0) throw new Error('Não é possível inverter o número zero.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 39. deve converter Fahrenheit para Celsius
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:96:7
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
 function inverso(n) {
-  if (n === 0) throw new Error('Não é possível inverter o número zero.');
+  if (true) throw new Error('Não é possível inverter o número zero.');
   return 1 / n;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 40. deve calcular o inverso de um número
statusReason: Error: Não é possível inverter o número zero.

[Killed] ConditionalExpression
src/operacoes.js:105:36
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
-function isMenorQue(a, b) { return a < b; }
+function isMenorQue(a, b) { return false; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 45. deve verificar se um número é menor que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/operacoes.js:106:33
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
-function isEqual(a, b) { return a === b; }
+function isEqual(a, b) { return a !== b; }
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 46. deve verificar se dois números são iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/operacoes.js:108:7
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
+  if (true) throw new Error('Array vazio не possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: Array vazio не possui mediana.
